tutorials/multiphase/vof/vofLPTSolver/ACCM_bubbleCol3D/0/alpha1.org
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1.org;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    sidewalls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
