tutorials/multiphase/vof/vofLPTSolver/ACCM_bubbleCol3D/system/blockMeshDict
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (-0.075 0.00 -0.075)
    ( 0.075 0.00 -0.075)
    ( 0.075 0.60 -0.075)
    (-0.075 0.60 -0.075)
    (-0.075 0.00  0.075)
    ( 0.075 0.00  0.075)
    ( 0.075 0.60  0.075)
    (-0.075 0.60  0.075)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)(32 128 32) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    sidewalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (0 3 2 1)
            (1 2 6 5)
            (4 5 6 7)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
