tutorials/multiphase/vof/vofLPTSolver/ACCM_bubbleCol3D/system/controlDict
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application     volLPTSolver;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         150;

deltaT          0.001;

writeControl    timeStep;

writeInterval   10000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression compressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable true;

maxCo           1;
maxAlphaCo      1;

functions
(
    fieldAverage
    {
	    type            fieldAverage;
	    functionObjectLibs ( "libfieldFunctionObjects.so" );
	    enabled         true;
	    timeStart       50;
	    resetFields     1;
	    writeControl   writeTime;
	    fields
	    (
	    	U
	    	{
	    		mean        on;
	    		prime2Mean  on;
	    		base        time;
	    	}
	    	p
	    	{
	    		mean        on;
	    		prime2Mean  off;
	    		base        time;
	    	}
	    	alpha1
	    	{
	    		mean        on;
	    		prime2Mean  off;
	    		base        time;
	    	}
	    	alphaD
	    	{
	    		mean        on;
	    		prime2Mean  off;
	    		base        time;
	    	}
	    	Ud
	    	{
	    		mean        on;
	    		prime2Mean  on;
	    		base        time;
	    	}
	    	nuSgs
	    	{
	    		mean        on;
	    		prime2Mean  off;
	    		base        time;
	    	}
	    );
    }
);


// ************************************************************************* //
